Tekla Open API Reference for Tekla Structures 2025
PluginPropertyFileLocationAttribute Constructor
Initializes a new instance of the PluginPropertyFileLocationAttribute class, for a file with provided filename suffix.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PluginPropertyFileLocationAttribute(
	string suffix,
	string subdirectory
)
Public Sub New (
	suffix As String,
	subdirectory As String
)
Parameters
suffix
Type: System.String
File suffix to register. Must contain the dot, such as ".ExamplePlugin.Data.txt". Should be as specific as possible.
subdirectory
Type: System.String
The model folder subdirectory where the attribute should be searched for.
See Also
Reference
PluginPropertyFileLocationAttribute Class
Tekla.Structures.Plugins Namespace